app/controllers/admin_controller.rb

SELECT "analytics".* FROM "analytics"
---
  def analytics
  if params[:field].nil?
    fields = "*"
  else
   fields = params[:field].map {|k,v| Analytics.parse_field(k) }.join(",")